In [1]:
import pandas as pd

In [16]:
sales_reps = pd.DataFrame({
    "rep_id": [1, 2, 3],
    "name":["Alice","Bob","Charlie"],
    "region": ["North","South","West"]
})

In [14]:
# Sales Data Table(Child)
sales = pd.DataFrame({
    "sale_id": [101, 102, 103, 104],
    "sale_rep_id":[1, 2, None, 4],#Incudes a missing and an unmatched ID
    "sale_amount": [500,1000, 750, 1200]
})

In [4]:
sales_reps

   rep_id     name region
0       1    Alice  North
1       2      Bob  South
2       3  Charlie   West

In [5]:
sales

   sale_id  sale_rep_id  sale_amount
0      101          1.0          500
1      102          2.0         1000
2      103          NaN          750
3      104          4.0         1200

Left Join

In [13]:
left_join = pd.merge(
    sales_reps,
    sales,
    left_on="rep_id",
    right_on ="sale_rep_id",
    how="left"
)

In [7]:
left_join

   rep_id     name region  sale_id  sale_rep_id  sale_amount
0       1    Alice  North    101.0          1.0        500.0
1       2      Bob  South    102.0          2.0       1000.0
2       3  Charlie   West      NaN          NaN          NaN

Right Joins

In [9]:
right_join = pd.merge(
    sales_reps,
    sales,
    left_on="rep_id",
    right_on="sale_rep_id",
    how="right"
)

In [10]:
right_join

   rep_id   name region  sale_id  sale_rep_id  sale_amount
0     1.0  Alice  North      101          1.0          500
1     2.0    Bob  South      102          2.0         1000
2     NaN    NaN    NaN      103          NaN          750
3     NaN    NaN    NaN      104          4.0         1200

In [17]:
inactive_reps = left_join[left_join["sale_id"].isnull()]

In [18]:
inactive_reps

   rep_id     name region  sale_id  sale_rep_id  sale_amount
2       3  Charlie   West      NaN          NaN          NaN

In [19]:
left_join.query("sale_id.isnull()")

   rep_id     name region  sale_id  sale_rep_id  sale_amount
2       3  Charlie   West      NaN          NaN          NaN

In [20]:
orphaned_sales = right_join[right_join["rep_id"].isnull()]

In [21]:
orphaned_sales

   rep_id name region  sale_id  sale_rep_id  sale_amount
2     NaN  NaN    NaN      103          NaN          750
3     NaN  NaN    NaN      104          4.0         1200

In [22]:
right_join.query("rep_id.isnull()")

   rep_id name region  sale_id  sale_rep_id  sale_amount
2     NaN  NaN    NaN      103          NaN          750
3     NaN  NaN    NaN      104          4.0         1200

In [23]:
right_join.fillna({"name": "Unknown","region":"Unknown"},inplace=True)

In [24]:
right_join

   rep_id     name   region  sale_id  sale_rep_id  sale_amount
0     1.0    Alice    North      101          1.0          500
1     2.0      Bob    South      102          2.0         1000
2     NaN  Unknown  Unknown      103          NaN          750
3     NaN  Unknown  Unknown      104          4.0         1200